{"mtime_ns":1772211651075481746,"size":11405,"module_info":{"file_path":"/home/mk/projects/Demarch/research/meta_skill/src/core/pack_contracts.rs","language":"rust","docstring":null,"imports":[{"module":"std::collections::{HashMap, HashSet}","names":[],"is_from":false,"line_number":3},{"module":"std::path::{Path, PathBuf}","names":[],"is_from":false,"line_number":4},{"module":"super::skill::PackContract","names":[],"is_from":false,"line_number":6},{"module":"crate::error::{MsError, Result}","names":[],"is_from":false,"line_number":7}],"classes":[{"name":"ContractStore","bases":[],"docstring":null,"methods":[],"decorators":[],"line_number":167}],"functions":[{"name":"(PackContractPreset) as_str","params":["&self"],"return_type":"&'static str","docstring":null,"is_method":true,"is_async":false,"decorators":[],"line_number":21,"language":"rust"},{"name":"(PackContractPreset) contract","params":["&self"],"return_type":"PackContract","docstring":null,"is_method":true,"is_async":false,"decorators":[],"line_number":33,"language":"rust"},{"name":"contract_from_name","params":["name: &str"],"return_type":"Option<PackContract>","docstring":null,"is_method":false,"is_async":false,"decorators":[],"line_number":145,"language":"rust"},{"name":"weight_map","params":["entries: &[(&str, f32)]"],"return_type":"HashMap<String, f32>","docstring":null,"is_method":false,"is_async":false,"decorators":[],"line_number":159,"language":"rust"},{"name":"(ContractStore) default","params":[],"return_type":"Self","docstring":null,"is_method":true,"is_async":false,"decorators":[],"line_number":173,"language":"rust"},{"name":"custom_contracts_path","params":["ms_root: &Path"],"return_type":"PathBuf","docstring":null,"is_method":false,"is_async":false,"decorators":[],"line_number":182,"language":"rust"},{"name":"builtin_contracts","params":[],"return_type":"Vec<PackContract>","docstring":null,"is_method":false,"is_async":false,"decorators":[],"line_number":187,"language":"rust"},{"name":"load_custom_contracts","params":["path: &Path"],"return_type":"Result<Vec<PackContract>>","docstring":null,"is_method":false,"is_async":false,"decorators":[],"line_number":201,"language":"rust"},{"name":"save_custom_contracts","params":["path: &Path","contracts: &[PackContract]"],"return_type":"Result<()>","docstring":null,"is_method":false,"is_async":false,"decorators":[],"line_number":219,"language":"rust"},{"name":"add_custom_contract","params":["path: &Path","mut contract: PackContract"],"return_type":"Result<()>","docstring":null,"is_method":false,"is_async":false,"decorators":[],"line_number":251,"language":"rust"},{"name":"find_custom_contract","params":["path: &Path","id: &str"],"return_type":"Result<Option<PackContract>>","docstring":null,"is_method":false,"is_async":false,"decorators":[],"line_number":269,"language":"rust"},{"name":"normalize_contracts","params":["contracts: Vec<PackContract>"],"return_type":"Vec<PackContract>","docstring":null,"is_method":false,"is_async":false,"decorators":[],"line_number":277,"language":"rust"},{"name":"normalize_contract","params":["mut contract: PackContract"],"return_type":"Result<PackContract>","docstring":null,"is_method":false,"is_async":false,"decorators":[],"line_number":284,"language":"rust"},{"name":"normalize_weights","params":["weights: &HashMap<String, f32>"],"return_type":"Result<HashMap<String, f32>>","docstring":null,"is_method":false,"is_async":false,"decorators":[],"line_number":309,"language":"rust"}],"call_graph":{"calls":{"(PackContractPreset) contract":["weight_map"],"contract_from_name":["as_str","contract"],"load_custom_contracts":["normalize_contracts"],"save_custom_contracts":["normalize_contracts"],"add_custom_contract":["normalize_contract","load_custom_contracts","builtin_contracts","save_custom_contracts"],"find_custom_contract":["load_custom_contracts"],"normalize_contracts":["normalize_contract"],"normalize_contract":["normalize_weights"]},"called_by":{"weight_map":["(PackContractPreset) contract"],"as_str":["contract_from_name"],"contract":["contract_from_name"],"normalize_contracts":["load_custom_contracts","save_custom_contracts"],"normalize_contract":["add_custom_contract","normalize_contracts"],"load_custom_contracts":["add_custom_contract","find_custom_contract"],"builtin_contracts":["add_custom_contract"],"save_custom_contracts":["add_custom_contract"],"normalize_weights":["normalize_contract"]}}}}